fixture/vcr_cassettes/transaction_make_payment.json

[
  {
    "request": {
      "body": "cardNumber=4564710000000004&cardholderName=Xplor&cvn=847&expiryDateMonth=02&expiryDateYear=29&paymentMethod=creditCard",
      "headers": {
        "Accept": "application/json",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "2a261cc9-9557-561c-8ed0-ff5b5a0cc704"
      },
      "method": "post",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/single-use-tokens"
    },
    "response": {
      "binary": false,
      "body": "{\r\n  \"singleUseTokenId\" : \"3427a440-b93e-4554-b06a-0897e06f50cf\",\r\n  \"paymentMethod\" : \"creditCard\",\r\n  \"creditCard\" : {\r\n    \"maskedCardNumber\" : \"456471...004\",\r\n    \"expiryDateMonth\" : \"02\",\r\n    \"expiryDateYear\" : \"29\",\r\n    \"cardScheme\" : \"visa\",\r\n    \"cardholderName\" : \"Xplor\",\r\n    \"surchargePercentage\" : 1.000\r\n  }\r\n}",
      "headers": {
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "327",
        "Date": "Fri, 09 Aug 2019 02:02:06 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd2362e21d964885ef11554e9a63b350f2606697b8418c0a9f53ee73d3e48d70385372d7cf85015e31aa13a414bfe05180aa; Path=/; Secure; HTTPOnly"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "bankAccountId=TEST&merchantId=TEST&singleUseTokenId=3427a440-b93e-4554-b06a-0897e06f50cf",
      "headers": {
        "Accept": "application/json",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "f1e3d145-2d69-565d-9d6b-6badbfe61dc2"
      },
      "method": "post",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/customers"
    },
    "response": {
      "binary": false,
      "body": "{\r\n  \"customerNumber\" : \"62092\",\r\n  \"paymentSetup\" : {\r\n    \"paymentMethod\" : \"creditCard\",\r\n    \"stopped\" : false,\r\n    \"creditCard\" : {\r\n      \"cardNumber\" : \"456471...004\",\r\n      \"expiryDateMonth\" : \"02\",\r\n      \"expiryDateYear\" : \"29\",\r\n      \"cardScheme\" : \"visa\",\r\n      \"cardholderName\" : \"Xplor\",\r\n      \"surchargePercentage\" : 1.0\r\n    },\r\n    \"merchant\" : {\r\n      \"merchantId\" : \"TEST\",\r\n      \"merchantName\" : \"Test Merchant\",\r\n      \"links\" : [ {\r\n        \"rel\" : \"self\",\r\n        \"href\" : \"https://api.payway.com.au/rest/v1/merchants/TEST\"\r\n      } ]\r\n    }\r\n  },\r\n  \"contact\" : {\r\n    \"customerName\" : \"Customer 62092\",\r\n    \"emailAddress\" : null,\r\n    \"sendEmailReceipts\" : false,\r\n    \"phoneNumber\" : null,\r\n    \"address\" : {\r\n      \"street1\" : null,\r\n      \"street2\" : null,\r\n      \"cityName\" : null,\r\n      \"state\" : null,\r\n      \"postalCode\" : null\r\n    }\r\n  },\r\n  \"customFields\" : { },\r\n  \"links\" : [ {\r\n    \"rel\" : \"self\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/62092\"\r\n  }, {\r\n    \"rel\" : \"help\",\r\n    \"href\" : \"https://www.payway.com.au/docs/rest.html#customers\"\r\n  }, {\r\n    \"rel\" : \"contact\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/62092/contact\"\r\n  }, {\r\n    \"rel\" : \"custom-fields\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/62092/custom-fields\"\r\n  }, {\r\n    \"rel\" : \"payment-setup\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/62092/payment-setup\"\r\n  }, {\r\n    \"rel\" : \"schedule\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/62092/schedule\"\r\n  }, {\r\n    \"rel\" : \"search-customer-transactions\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/transactions/search-customer?customerNumber=62092\"\r\n  } ]\r\n}",
      "headers": {
        "Location": "https://api.payway.com.au/rest/v1/customers/62092",
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "1720",
        "Date": "Fri, 09 Aug 2019 02:02:06 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd232920498b01d6b7cbb724811a42fb77cb8b1dd2a0466bfdaec101dd98fec20cabe626685a8f990ddff3a572b30b01ef7b; Path=/; Secure; HTTPOnly"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "bankAccountId=TEST&currency=aud&customerNumber=62092&merchantId=TEST&orderNumber=XPLOR_SCHOOLS_007&principalAmount=1337.42&transactionType=payment",
      "headers": {
        "Accept": "application/json",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "51496129-0e3c-5254-8854-c1821504cc6b"
      },
      "method": "post",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/transactions"
    },
    "response": {
      "binary": false,
      "body": "{\r\n  \"transactionId\" : 2493900614,\r\n  \"receiptNumber\" : \"2493900614\",\r\n  \"status\" : \"approved\",\r\n  \"responseCode\" : \"08\",\r\n  \"responseText\" : \"Honour with identification\",\r\n  \"transactionType\" : \"payment\",\r\n  \"customerNumber\" : \"62092\",\r\n  \"customerName\" : \"Customer 62092\",\r\n  \"orderNumber\" : \"XPLOR_SCHOOLS_007\",\r\n  \"currency\" : \"aud\",\r\n  \"principalAmount\" : 1337.42,\r\n  \"surchargeAmount\" : 13.37,\r\n  \"paymentAmount\" : 1350.79,\r\n  \"paymentMethod\" : \"creditCard\",\r\n  \"creditCard\" : {\r\n    \"cardNumber\" : \"456471...004\",\r\n    \"expiryDateMonth\" : \"02\",\r\n    \"expiryDateYear\" : \"29\",\r\n    \"cardScheme\" : \"visa\",\r\n    \"cardholderName\" : \"Xplor\"\r\n  },\r\n  \"merchant\" : {\r\n    \"merchantId\" : \"TEST\",\r\n    \"merchantName\" : \"Test Merchant\",\r\n    \"links\" : [ {\r\n      \"rel\" : \"self\",\r\n      \"href\" : \"https://api.payway.com.au/rest/v1/merchants/TEST\"\r\n    } ]\r\n  },\r\n  \"transactionDateTime\" : \"09 Aug 2019 12:02 AEST\",\r\n  \"settlementDate\" : \"09 Aug 2019\",\r\n  \"isVoidable\" : true,\r\n  \"isRefundable\" : false,\r\n  \"links\" : [ {\r\n    \"rel\" : \"self\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/transactions/2493900614\"\r\n  }, {\r\n    \"rel\" : \"void\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/transactions/2493900614/void\"\r\n  } ]\r\n}",
      "headers": {
        "Location": "https://api.payway.com.au/rest/v1/transactions/2493900614",
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "1227",
        "Date": "Fri, 09 Aug 2019 02:02:07 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd236b0661306e77658b41b7709de2cbd902d01d6a69c7c6862079f1f65b40d7453357f5868db0b3a8ce4aa3af18f0f909bc; Path=/; Secure; HTTPOnly"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Accept": "application/json"
      },
      "method": "get",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/transactions/2493900614"
    },
    "response": {
      "binary": false,
      "body": "{\r\n  \"transactionId\" : 2493900614,\r\n  \"receiptNumber\" : \"2493900614\",\r\n  \"status\" : \"approved\",\r\n  \"responseCode\" : \"08\",\r\n  \"responseText\" : \"Honour with identification\",\r\n  \"transactionType\" : \"payment\",\r\n  \"customerNumber\" : \"62092\",\r\n  \"customerName\" : \"Customer 62092\",\r\n  \"orderNumber\" : \"XPLOR_SCHOOLS_007\",\r\n  \"currency\" : \"aud\",\r\n  \"principalAmount\" : 1337.42,\r\n  \"surchargeAmount\" : 13.37,\r\n  \"paymentAmount\" : 1350.79,\r\n  \"paymentMethod\" : \"creditCard\",\r\n  \"creditCard\" : {\r\n    \"cardNumber\" : \"456471...004\",\r\n    \"expiryDateMonth\" : \"02\",\r\n    \"expiryDateYear\" : \"29\",\r\n    \"cardScheme\" : \"visa\",\r\n    \"cardholderName\" : \"Xplor\"\r\n  },\r\n  \"merchant\" : {\r\n    \"merchantId\" : \"TEST\",\r\n    \"merchantName\" : \"Test Merchant\",\r\n    \"links\" : [ {\r\n      \"rel\" : \"self\",\r\n      \"href\" : \"https://api.payway.com.au/rest/v1/merchants/TEST\"\r\n    } ]\r\n  },\r\n  \"transactionDateTime\" : \"09 Aug 2019 12:02 AEST\",\r\n  \"settlementDate\" : \"09 Aug 2019\",\r\n  \"isVoidable\" : true,\r\n  \"isRefundable\" : false,\r\n  \"links\" : [ {\r\n    \"rel\" : \"help\",\r\n    \"href\" : \"https://www.payway.com.au/docs/rest.html#transactions\"\r\n  }, {\r\n    \"rel\" : \"void\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/transactions/2493900614/void\"\r\n  }, {\r\n    \"rel\" : \"customer\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/62092\"\r\n  } ]\r\n}",
      "headers": {
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "1322",
        "Date": "Fri, 09 Aug 2019 02:02:09 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd2324a33419e36a767dc4529ab1b07b47cc8a044253f8f611275b742ffb8513da4666d1adcbe11b5c563dc6729157dfcb7d; Path=/; Secure; HTTPOnly"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]